Revit 2026 API

# RebarGetOverridableHookParameters Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void GetOverridableHookParameters(
	out ISet<ElementId> startHookLengthPrameters,
	out ISet<ElementId> startHookTangentLengthParameters,
	out ISet<ElementId> endHookLengthParameters,
	out ISet<ElementId> endHookTangentLengthParameters
)
```
```vb
Public Sub GetOverridableHookParameters (
	<OutAttribute> ByRef startHookLengthPrameters As ISet(Of ElementId),
	<OutAttribute> ByRef startHookTangentLengthParameters As ISet(Of ElementId),
	<OutAttribute> ByRef endHookLengthParameters As ISet(Of ElementId),
	<OutAttribute> ByRef endHookTangentLengthParameters As ISet(Of ElementId)
)
```
```cpp
public:
void GetOverridableHookParameters(
	[OutAttribute] ISet<ElementId^>^% startHookLengthPrameters,
	[OutAttribute] ISet<ElementId^>^% startHookTangentLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookLengthParameters,
	[OutAttribute] ISet<ElementId^>^% endHookTangentLengthParameters
)
```
```fsharp
member GetOverridableHookParameters :
        startHookLengthPrameters : ISet<ElementId> byref *
        startHookTangentLengthParameters : ISet<ElementId> byref *
        endHookLengthParameters : ISet<ElementId> byref *
        endHookTangentLengthParameters : ISet<ElementId> byref -> unit
```

#### Parameters

startHookLengthPrameters ISetElementId

startHookTangentLengthParameters ISetElementId

endHookLengthParameters ISetElementId

endHookTangentLengthParameters ISetElementId

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace